meeting/agenda/2023/03-07.org
:PROPERTIES:
:ID:       FE2F56FF-02B9-46D5-87A7-EAB95EC1221C
:END:
#+title: QT4 CG Meeting 025 Agenda 2023-03-07
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00GMT (17:00CET, 11:00EST).

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2023/02-28.html][the previous meeting]].

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for
7 March,
the following meeting is scheduled for
14 March.

Any regrets for the following meeting?

** Review of open action items [1/7]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [ ] QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group
+ [ ] QT4CG-016-08: RD to clarify how namespace comparisons are performed.
+ [ ] QT4CG-023-01: NW to review the stylesheets for functions across XPath and XSLT
+ [ ] QT4CG-023-05: NW to put record types on an agenda.
+ [ ] QT4CG-024-01: MK to add namespace-uri-for-prefix argument changes to the compatibility appendix
+ [ ] QT4CG-024-02: DN to develop an alternative proposal for deep-action.
+ [X] QT4CG-024-03: NW to create issues for improving fn:deep-equal

* Technical Agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

Last week, the suggestion was made that we try to clear up a bit of
the back log in PRs by reviewing some of the smaller, simpler ones.
Please read these issues in preparation for the meeting so that we are
more likely to be able to move through them swiftly.

** PR #375: Context for default parameter values
:PROPERTIES:
:CUSTOM_ID: h-074E7C57-5C3A-4FA8-AF9E-EAFE0F504864
:END:

Contrary to the remark above, this /is not/ a small issue. But it’s a
bug and deseves high priority. I propose a 30 minute time box on this
issue so that we do have time to resolve some low hanging fruit.

See [[https://qt4cg.org/dashboard/#pr-375][pull request #375]].

** PR #378: Update the localName and unparsed entity reference notes for parse-html
:PROPERTIES:
:CUSTOM_ID: h-7AC1783C-19E6-4163-8BE0-236FBABFE76E
:END:

See [[https://qt4cg.org/dashboard/#pr-378][pull request #378]].

** PR #371: Issue 370: forwards and backwards compatibility for 4.0
:PROPERTIES:
:CUSTOM_ID: h-EDC3E35B-2AD7-4E6F-B92D-4369CF84D8DC
:END:

See [[https://qt4cg.org/dashboard/#pr-371][pull request #371]].

** PR #364: Generalize switch expressions in XQuery
:PROPERTIES:
:CUSTOM_ID: pr364
:END:

See [[https://qt4cg.org/dashboard/#pr-364][pull request #364]].

** PR #363: Issue 345; missing rules for type matching
:PROPERTIES:
:CUSTOM_ID: pr363
:END:

See [[https://qt4cg.org/dashboard/#pr-363][pull request #363]].


** PR #355: Add to imp-defined-feature-appendix
:PROPERTIES:
:CUSTOM_ID: pr355
:END:

See [[https://qt4cg.org/dashboard/#pr-355][pull request #355]].


** PR #344: Issue 22: allow "for"/"let" keyword to be repeated in XPath
:PROPERTIES:
:CUSTOM_ID: h-751A3ADC-981F-4AB4-BFE4-523B8CD342C7
:END:

See [[https://qt4cg.org/dashboard/#pr-344][pull request #344]].

** PR #347: Attempt to clarify fn:parse-uri and fn:build-uri
:PROPERTIES:
:CUSTOM_ID: h-9AF44047-B476-419D-A158-13D6BD879D4C
:END:

See [[https://qt4cg.org/dashboard/#pr-347][pull request #347]].

** More issues
:PROPERTIES:
:CUSTOM_ID: h-CD4601A9-0817-4CFE-9873-A67957243B82
:END:

If we get through all of the PRs proposed above, we’ll take on any additional
issues that the group suggests.

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:
