meeting/agenda/2023/03-07.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 025 Agenda 2023-03-07</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 025 Agenda 2023-03-07</h1>

<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00GMT (17:00CET, 11:00EST).
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for details.
</p>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>

<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2023/02-28.html">the previous meeting</a>.
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for
7 March,
the following meeting is scheduled for
14 March.
</p>

<p>
Any regrets for the following meeting?
</p>
</div>
</div>

<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[1/7]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-016-08: RD to clarify how namespace comparisons are performed.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-023-01: NW to review the stylesheets for functions across XPath and XSLT</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-023-05: NW to put record types on an agenda.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-024-01: MK to add namespace-uri-for-prefix argument changes to the compatibility appendix</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-024-02: DN to develop an alternative proposal for deep-action.</li>
<li class="on"><code>[X]</code> QT4CG-024-03: NW to create issues for improving fn:deep-equal</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical Agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
<p>
Last week, the suggestion was made that we try to clear up a bit of
the back log in PRs by reviewing some of the smaller, simpler ones.
Please read these issues in preparation for the meeting so that we are
more likely to be able to move through them swiftly.
</p>
</div>

<div id="outline-container-h-074E7C57-5C3A-4FA8-AF9E-EAFE0F504864" class="outline-3">
<h3 id="h-074E7C57-5C3A-4FA8-AF9E-EAFE0F504864"><span class="section-number-3">2.1.</span> PR #375: Context for default parameter values</h3>
<div class="outline-text-3" id="text-h-074E7C57-5C3A-4FA8-AF9E-EAFE0F504864">
<p>
Contrary to the remark above, this <i>is not</i> a small issue. But it’s a
bug and deseves high priority. I propose a 30 minute time box on this
issue so that we do have time to resolve some low hanging fruit.
</p>

<p>
See <a href="https://qt4cg.org/dashboard/#pr-375">pull request #375</a>.
</p>
</div>
</div>

<div id="outline-container-h-7AC1783C-19E6-4163-8BE0-236FBABFE76E" class="outline-3">
<h3 id="h-7AC1783C-19E6-4163-8BE0-236FBABFE76E"><span class="section-number-3">2.2.</span> PR #378: Update the localName and unparsed entity reference notes for parse-html</h3>
<div class="outline-text-3" id="text-h-7AC1783C-19E6-4163-8BE0-236FBABFE76E">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-378">pull request #378</a>.
</p>
</div>
</div>

<div id="outline-container-h-EDC3E35B-2AD7-4E6F-B92D-4369CF84D8DC" class="outline-3">
<h3 id="h-EDC3E35B-2AD7-4E6F-B92D-4369CF84D8DC"><span class="section-number-3">2.3.</span> PR #371: Issue 370: forwards and backwards compatibility for 4.0</h3>
<div class="outline-text-3" id="text-h-EDC3E35B-2AD7-4E6F-B92D-4369CF84D8DC">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-371">pull request #371</a>.
</p>
</div>
</div>

<div id="outline-container-pr364" class="outline-3">
<h3 id="pr364"><span class="section-number-3">2.4.</span> PR #364: Generalize switch expressions in XQuery</h3>
<div class="outline-text-3" id="text-pr364">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-364">pull request #364</a>.
</p>
</div>
</div>

<div id="outline-container-pr363" class="outline-3">
<h3 id="pr363"><span class="section-number-3">2.5.</span> PR #363: Issue 345; missing rules for type matching</h3>
<div class="outline-text-3" id="text-pr363">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-363">pull request #363</a>.
</p>
</div>
</div>


<div id="outline-container-pr355" class="outline-3">
<h3 id="pr355"><span class="section-number-3">2.6.</span> PR #355: Add to imp-defined-feature-appendix</h3>
<div class="outline-text-3" id="text-pr355">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-355">pull request #355</a>.
</p>
</div>
</div>


<div id="outline-container-h-751A3ADC-981F-4AB4-BFE4-523B8CD342C7" class="outline-3">
<h3 id="h-751A3ADC-981F-4AB4-BFE4-523B8CD342C7"><span class="section-number-3">2.7.</span> PR #344: Issue 22: allow "for"/"let" keyword to be repeated in XPath</h3>
<div class="outline-text-3" id="text-h-751A3ADC-981F-4AB4-BFE4-523B8CD342C7">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-344">pull request #344</a>.
</p>
</div>
</div>

<div id="outline-container-h-9AF44047-B476-419D-A158-13D6BD879D4C" class="outline-3">
<h3 id="h-9AF44047-B476-419D-A158-13D6BD879D4C"><span class="section-number-3">2.8.</span> PR #347: Attempt to clarify fn:parse-uri and fn:build-uri</h3>
<div class="outline-text-3" id="text-h-9AF44047-B476-419D-A158-13D6BD879D4C">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-347">pull request #347</a>.
</p>
</div>
</div>

<div id="outline-container-h-CD4601A9-0817-4CFE-9873-A67957243B82" class="outline-3">
<h3 id="h-CD4601A9-0817-4CFE-9873-A67957243B82"><span class="section-number-3">2.9.</span> More issues</h3>
<div class="outline-text-3" id="text-h-CD4601A9-0817-4CFE-9873-A67957243B82">
<p>
If we get through all of the PRs proposed above, we’ll take on any additional
issues that the group suggests.
</p>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>
